Config/DataProcessors/ПомощникРаспределенияОплатОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПомощникРаспределенияОплатОбразование</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполняемоеДействие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРаспределения</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеДетали</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВалютаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВалютаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/Documents/РаспределениеОплатыОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РаспределениеОплатыОбразование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСоСтудентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСоСтудентамиДопУслуги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факультет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВалюта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетыДопУслуги</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислениеЗаУслугу</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НачисленияСтудентамЗаПрочиеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеОбщихДоговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВалюта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/DataProcessors/ПомощникРаспределенияОплатОбразование/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецПериода = КонецДня(ТекущаяДата());
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") Тогда
		НепроверяемыеРеквизиты.Добавить("Факультет");
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	Если НачалоПериода > КонецПериода Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Начало периода больше конца периода!'"),,
			"НачалоПериода",, Отказ);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	Объект.Распределение.Очистить();
	Объект.РаспределениеДетали.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	Объект.Распределение.Очистить();
	Объект.РаспределениеДетали.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределение

&НаКлиенте
Процедура РаспределениеПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("РаспределениеПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Распределение.ТекущиеДанные;
	
	Если Поле.Имя = "РаспределениеДокументРаспределения" Тогда
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДокументРаспределения) Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение(Неопределено, ТекущаяСтрока.ДокументРаспределения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеДетали

&НаКлиенте
Процедура РаспределениеДеталиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.РаспределениеДетали.ТекущиеДанные;
	
	Если Поле.Имя = "РаспределениеДеталиДокументОплаты" Тогда
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДокументОплаты) Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение(Неопределено, ТекущаяСтрока.ДокументОплаты);
		КонецЕсли;
		
	КонецЕсли;
	 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		ОчиститьСообщения();
		ОбновитьСписокНаСервере();
	
		Если Объект.Распределение.Количество() > 0 Тогда
			
			Элементы.Распределение.ТекущаяСтрока = Объект.Распределение[0].ПолучитьИдентификатор();
			
			СтруктураОтбора = Новый Структура("Период", Объект.Распределение[0].Период);
			Элементы.РаспределениеДетали.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
			
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого СтрокаРаспределения Из Объект.Распределение Цикл
		
		Если СтрокаРаспределения.ВыполняемоеДействие <> 0 И СтрокаРаспределения.ВыполняемоеДействие <> 99 Тогда
			СтрокаРаспределения.Выполнить = Истина;
		Иначе
			СтрокаРаспределения.Выполнить = Ложь;
		КонецЕсли; 
		
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого СтрокаРаспределения Из Объект.Распределение Цикл
		СтрокаРаспределения.Выполнить = Ложь;
	КонецЦикла; 	
	 	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействия(Команда)
	
	СтруктураОтбора = Новый Структура("Выполнить", Истина);
	
	Если Объект.Распределение.Количество() > 0
		И Объект.Распределение.НайтиСтроки(СтруктураОтбора).Количество() > 0 Тогда
		
		ОчиститьСообщения();
		ВыполнитьДействияСервер();
		
	Иначе
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Нет операций к выполнению!'"));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	ПараметрыФормы = Новый Структура("НачалоПериода, КонецПериода", НачалоПериода, КонецПериода);
	
	Оповещение = Новый ОписаниеОповещения("УстановитьПериодОповещение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.НастройкаПериодаОтчета", ПараметрыФормы, ЭтаФорма, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура УстановитьПериодОповещение(Выбор, ДопПараметры) Экспорт
	Если Выбор <> Неопределено И ТипЗнч(Выбор) = Тип("Структура") Тогда
		НачалоПериода = Выбор.НачалоПериода;
		КонецПериода  = Выбор.КонецПериода;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ВыполнитьДействияСервер()
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаПериодов.Период,
	               |	ТаблицаПериодов.Выполнить,
	               |	ТаблицаПериодов.ДокументРаспределения
	               |ПОМЕСТИТЬ ТаблицаПериодовПредварительная
	               |ИЗ
	               |	&ТаблицаПериодов КАК ТаблицаПериодов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаблицаПериодовПредварительная.Период,
	               |	ТаблицаПериодовПредварительная.ДокументРаспределения
	               |ПОМЕСТИТЬ ТаблицаПериодов
	               |ИЗ
	               |	ТаблицаПериодовПредварительная КАК ТаблицаПериодовПредварительная
	               |ГДЕ
	               |	ТаблицаПериодовПредварительная.Выполнить
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаспределениеОплатыОбразование.Ссылка КАК ДокументРаспределенияФакт,
	               |	НАЧАЛОПЕРИОДА(РаспределениеОплатыОбразование.Дата, ДЕНЬ) КАК Дата
	               |ПОМЕСТИТЬ ДокументыРаспределения
	               |ИЗ
	               |	Документ.РаспределениеОплатыОбразование КАК РаспределениеОплатыОбразование
	               |ГДЕ
	               |	РаспределениеОплатыОбразование.Проведен
	               |	И НАЧАЛОПЕРИОДА(РаспределениеОплатыОбразование.Дата, ДЕНЬ) В
	               |			(ВЫБРАТЬ
	               |				НАЧАЛОПЕРИОДА(ТаблицаПериодов.Период, ДЕНЬ)
	               |			ИЗ
	               |				ТаблицаПериодов КАК ТаблицаПериодов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПериодов.Период КАК Период,
	               |	ТаблицаПериодов.ДокументРаспределения,
	               |	ВЫРАЗИТЬ(ТаблицаПериодов.ДокументРаспределения КАК Документ.РаспределениеОплатыОбразование).Проведен КАК ДокументРаспределенияПроведен,
	               |	ДокументыРаспределения.ДокументРаспределенияФакт,
	               |	СУММА(1) КАК КоличествоЗаписей
	               |ИЗ
	               |	ТаблицаПериодов КАК ТаблицаПериодов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыРаспределения КАК ДокументыРаспределения
	               |		ПО ТаблицаПериодов.Период = ДокументыРаспределения.Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаПериодов.ДокументРаспределения,
	               |	ДокументыРаспределения.ДокументРаспределенияФакт,
	               |	ТаблицаПериодов.Период,
	               |	ВЫРАЗИТЬ(ТаблицаПериодов.ДокументРаспределения КАК Документ.РаспределениеОплатыОбразование).Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаПериодов", Объект.Распределение.Выгрузить());
	
	ТаблицаВыполнения = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаАнализа Из ТаблицаВыполнения Цикл
		
		Если СтрокаАнализа.КоличествоЗаписей > 1  Тогда
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'За период %1 обнаружено расхождение данных по документам распределения. Действующих документов больше одного!'"),
				Формат(СтрокаАнализа.Период, "ДЛФ=D"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		ИначеЕсли ЗначениеЗаполнено(СтрокаАнализа.ДокументРаспределения) И СтрокаАнализа.ДокументРаспределения <> СтрокаАнализа.ДокументРаспределенияФакт Тогда
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'За период %1 обнаружено расхождение данных по документу распределения. Требуется выполнить операцию еще раз!'"),
				Формат(СтрокаАнализа.Период, "ДЛФ=D"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		Иначе
			
			ДокументОбъект = Неопределено;
			
			Если ЗначениеЗаполнено(СтрокаАнализа.ДокументРаспределения)
				И СтрокаАнализа.ДокументРаспределенияПроведен = Истина Тогда
				
				ДокументОбъект = СтрокаАнализа.ДокументРаспределения.ПолучитьОбъект();
				
				Если ЗначениеЗаполнено(Факультет) Тогда
					ДокументОбъект.Факультет = Факультет;
				КонецЕсли;
				
			Иначе
				
				ДокументОбъект = Документы.РаспределениеОплатыОбразование.СоздатьДокумент();
				ДокументОбъект.Дата = СтрокаАнализа.Период;
				ДокументОбъект.Организация = Организация;
				Если ЗначениеЗаполнено(Факультет) Тогда
					ДокументОбъект.Факультет = Факультет;
				КонецЕсли;
				
			КонецЕсли;
			
			РаботаСоСтудентами.ЗаполнитьДокументРаспределения(ДокументОбъект);
			
			Если ДокументОбъект.Распределение.Количество()=0 И 
				ДокументОбъект.РаспределениеОбщихДоговоров.Количество()=0 Тогда
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'За период %1 не удалось выполнить заполнение документа. Данные учащихся за этот день не позволяют выполнить распределение оплаты.'"),
				Формат(СтрокаАнализа.Период, "ДЛФ=D"));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);				
			Иначе	
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьСписокНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВыполнениеДействие(СтрокаДанных, ВыполняемоеДействие)

	Если СтрокаДанных.ВыполняемоеДействие <> 99 Тогда
		
		СтрокаДанных.Выполнить = Истина;
		СтрокаДанных.ВыполняемоеДействие = ВыполняемоеДействие;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	
	Объект.Распределение.Очистить();
	Объект.РаспределениеДетали.Очистить();
	
	СхемаКомпоновкиДанных = Обработки.ПомощникРаспределенияОплатОбразование.ПолучитьМакет("СхемаПроверкиРаспределения");
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(НачалоПериода));
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода",  КонецДня(КонецПериода));
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекущаяДата",  ТекущаяДата());
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Организация",   Организация);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Счет000",
		БухгалтерскийУчет.СчетПоКоду("000"));
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВалютаРегламентированногоУчета",
		ОбщегоНазначенияБГУПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	
	СпискиСчетов = Новый Структура;
	СпискиСчетов.Вставить("СчетКазначейство",   "201.11");
	СпискиСчетов.Вставить("СчетБанкРубли",      "201.21");
	СпискиСчетов.Вставить("СчетЭквайрингРубли", "201.23");
	СпискиСчетов.Вставить("СчетБанкВалюта",     "201.27");
	СпискиСчетов.Вставить("СчетКасса",          "201.34");
	
	СпискиСчетов.Вставить("СчетПереноса",		"304.04,304.06,304.66,304.76,304.86,304.96");
	СпискиСчетов.Вставить("СчетКомиссии",		"210.05");
	
	Для каждого СчетИзСписка Из СпискиСчетов Цикл
	
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(БухгалтерскийУчет.СписокСчетов(СчетИзСписка.Значение, КонецПериода,,Организация));
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, СчетИзСписка.Ключ, Список);
	
	КонецЦикла;
	
	СчетаЗачетаОплаты = БухгалтерскийУчет.СписокСчетов("205.30,205.29,209.34", НачалоПериода,,Организация);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаЗачетаОплаты,
		БухгалтерскийУчет.СписокСчетов("205.30,205.29,209.34", КонецПериода,,Организация), Истина);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетЗачетаОплаты", СчетаЗачетаОплаты);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") И ЗначениеЗаполнено(Факультет) Тогда
		
		СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "ПодразделениеЗаполнения", Факультет);
				
	КонецЕсли; 
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки,,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"), Ложь);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,, Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ДанныеОтчета = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ДанныеОтчета = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	СоответствиеПериодов = Новый Соответствие;
	УжеБылиОшибкиВПериоде = Новый Соответствие;
	
	// ВыполняемоеДействие = 0 - ничего не делаем
	// ВыполняемоеДействие = 1 - требуется перезаполнение распределения
	// ВыполняемоеДействие = 2 - требуется создание документа распределения
	// ВыполняемоеДействие = 99 - ошибочная ситуация
	
	Для каждого СтрокаДанных Из ДанныеОтчета Цикл
		
		Если СоответствиеПериодов[СтрокаДанных.Период] = Неопределено Тогда
			СоответствиеПериодов[СтрокаДанных.Период] = Объект.Распределение.Добавить();
		КонецЕсли; 		
		СтрокаПериода = СоответствиеПериодов[СтрокаДанных.Период];
		СтрокаПериода.Период = СтрокаДанных.Период;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ДокументРаспределенияФакт) Тогда
			
			Если ЗначениеЗаполнено(СтрокаПериода.ДокументРаспределения)
				И СтрокаПериода.ДокументРаспределения <> СтрокаДанных.ДокументРаспределенияФакт Тогда
				
				СтрокаПериода.ВыполняемоеДействие = 99;
				
				Если УжеБылиОшибкиВПериоде[СтрокаДанных.Период] = Неопределено Тогда
					
					УжеБылиОшибкиВПериоде[СтрокаДанных.Период] = Истина;
					ТекстСообщения = СтрШаблон(НСтр("ru = 'За период %1 обнаружено несколько действущих документов распределения!'"),
						Формат(СтрокаПериода.Период, "ДЛФ=D"));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				
				КонецЕсли; 
				
			Иначе
				
				СтрокаПериода.ДокументРаспределения = СтрокаДанных.ДокументРаспределенияФакт;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если СтрокаДанных.ЕстьЗаписиПоСтудентам Тогда
			
			Если СтрокаДанных.СуммаФакт = 0 ИЛИ СтрокаДанных.СуммаВалютаФакт = 0 Тогда
				
				// Есть студенты, но нет распределения
				НоваяСтрока = Объект.РаспределениеДетали.Добавить();
				ЗаполнитьСтрокуПоСтрокеДанных(НоваяСтрока, СтрокаДанных);
				УстановитьВыполнениеДействие(СтрокаПериода, 1);
				
			ИначеЕсли СтрокаДанных.СуммаФакт <> СтрокаДанных.СуммаПлан
				ИЛИ СтрокаДанных.СуммаВалютаФакт <> СтрокаДанных.СуммаВалютаПлан Тогда
				
				// Есть студенты, есть распределение, но не до конца
				НоваяСтрока = Объект.РаспределениеДетали.Добавить();
				ЗаполнитьСтрокуПоСтрокеДанных(НоваяСтрока, СтрокаДанных);
				УстановитьВыполнениеДействие(СтрокаПериода, 1);
				
			КонецЕсли;
						
		Иначе
			
			Если СтрокаДанных.СуммаФакт <> 0 ИЛИ СтрокаДанных.СуммаВалютаФакт <> 0 Тогда
				
				// Нет студентов, но есть распределение
				НоваяСтрока = Объект.РаспределениеДетали.Добавить();
				ЗаполнитьСтрокуПоСтрокеДанных(НоваяСтрока, СтрокаДанных);
				УстановитьВыполнениеДействие(СтрокаПериода, 1);
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Для каждого СтрокаПериода Из Объект.Распределение Цикл
		
		// Определяем, требуется перезаполнение документа, создание или возникла ошибочная ситуация
		Если СтрокаПериода.ВыполняемоеДействие <> 99
			И СтрокаПериода.Выполнить
			И НЕ ЗначениеЗаполнено(СтрокаПериода.ДокументРаспределения) Тогда
			СтрокаПериода.ВыполняемоеДействие = 2;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Объект.Распределение.Сортировать("Период");
	Объект.РаспределениеДетали.Сортировать("Контрагент");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуПоСтрокеДанных(НоваяСтрока, СтрокаДанных)
	
	НоваяСтрока.Период = СтрокаДанных.Период;
	НоваяСтрока.Контрагент = СтрокаДанных.Контрагент;
	НоваяСтрока.ДоговорКонтрагента = СтрокаДанных.ДоговорКонтрагента;
	НоваяСтрока.Валюта = СтрокаДанных.Валюта;
	НоваяСтрока.ДокументОплаты = СтрокаДанных.ДокументОплаты;
	НоваяСтрока.СуммаФакт = СтрокаДанных.СуммаФакт;
	НоваяСтрока.СуммаПлан = СтрокаДанных.СуммаПлан;
	НоваяСтрока.СуммаВалютаФакт = СтрокаДанных.СуммаВалютаФакт;
	НоваяСтрока.СуммаВалютаПлан = СтрокаДанных.СуммаВалютаПлан;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущаяСтрокаПериода = Элементы.Распределение.ТекущиеДанные;
	
	Если ТекущаяСтрокаПериода <> Неопределено Тогда
		
		СтруктураОтбора = Новый Структура("Период", ТекущаяСтрокаПериода.Период);
		Элементы.РаспределениеДетали.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыРаспределениеОплатыОбразование(Команда)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Организация", Организация);
	Если ЗначениеЗаполнено(Факультет) Тогда
		Отбор.Вставить("Факультет", Факультет);
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Документ.РаспределениеОплатыОбразование.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
